Revit 2027 API
IFCExportOptions.FamilyMappingFile Property
 Path to a file containing family mapping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string FamilyMappingFile { get; set; }
Public Property FamilyMappingFile As String
	Get
	Set
public:
property String^ FamilyMappingFile {
	String^ get ();
	void set (String^ value);
}
member FamilyMappingFile : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 The file, if specified, contains data describing how to map generic family instances to IFC containers (element types). This property may be empty, in which case the current mapping will be used. The default is an empty string.
See Also
Reference
IFCExportOptions Class
Autodesk.Revit.DB Namespace